Revit 2027 API
MEPBuildingConstructionSetIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPBuildingConstructionSetIterator()
Public Sub New
public:
MEPBuildingConstructionSetIterator()
new : unit -> MEPBuildingConstructionSetIterator
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
Reference
MEPBuildingConstructionSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace